//
//  IndexOfKorean.m
//  LearnKoreanWord
//
//  Created by diguojin on 15/7/15.
//  Copyright (c) 2015年 diguojin. All rights reserved.
//

#import "IndexOfKorean.h"

@implementation IndexOfKorean
- (NSArray *)indexArray
{
    if (!_indexArray) {
        _indexArray = [NSArray new];
        _indexArray = @[@"가",@"나",@"다",@"라",@"마",@"바",@"사",@"아",@"자",@"차",@"카",@"타",@"파",@"하",@"갸",@"냐",@"댜",@"랴",@"먀",@"뱌",@"샤",@"야",@"쟈",@"챠",@"캬",@"탸",@"퍄",@"햐",@"거",@"너",@"더",@"러",@"머",@"버",@"서",@"어",@"저",@"처",@"커",@"터",@"퍼",@"허",@"겨",@"녀",@"뎌",@"려",@"며",@"벼",@"셔",@"여",@"져",@"쳐",@"켜",@"텨",@"펴",@"혀",@"고",@"노",@"도",@"로",@"모",@"보",@"소",@"오",@"조",@"초",@"코",@"토",@"포",@"호",@"교",@"뇨",@"됴",@"료",@"묘",@"뵤",@"쇼",@"요",@"죠",@"쵸",@"쿄",@"툐",@"표",@"효",@"구",@"누",@"두",@"루",@"무",@"부",@"수",@"우",@"주",@"추",@"쿠",@"투",@"푸",@"후",@"규",@"뉴",@"듀",@"류",@"뮤",@"뷰",@"슈",@"유",@"쥬",@"쥬",@"츄",@"큐",@"튜",@"퓨",@"휴",@"그",@"느",@"드",@"르",@"므",@"브",@"스",@"으",@"즈",@"츠",@"크",@"트",@"프",@"흐",@"기",@"니",@"디",@"리",@"미",@"비",@"시",@"이",@"지",@"치",@"키",@"티",@"피",@"히",@"개",@"내",@"대",@"래",@"매",@"배",@"새",@"애",@"재",@"채",@"캐",@"태",@"패",@"해",@"게",@"네",@"데",@"레",@"메",@"베",@"세",@"에",@"제",@"체",@"케",@"테",@"페",@"헤",@"괴",@"뇌",@"되",@"뢰",@"뫼",@"뵈",@"쇠",@"외",@"죄",@"최",@"쾨",@"퇴",@"푀",@"회",@"과",@"놔",@"돠",@"롸",@"뫄",@"봐",@"솨",@"와",@"좌",@"촤",@"콰",@"톼",@"퐈",@"화",@"귀",@"뉘",@"뒤",@"뤼",@"뮈",@"뷔",@"쉬",@"위",@"쥐",@"취",@"퀴",@"튀",@"퓌",@"휘",@"궈",@"눠",@"둬",@"뤄",@"뭐",@"붜",@"숴",@"워",@"줘",@"춰",@"쿼",@"퉈",@"풔",@"훠"];
    }
    return _indexArray;
}

- (NSString *)KoreanIndexAtIndex:(NSInteger)index
{
    NSString *koreanIndex = @"없음";
    if(index >= 0 && index < [self.indexArray count]){
        koreanIndex = self.indexArray[index];
    }
    return koreanIndex;
}

@end
